src/Documents/УстановкаЛимитовБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УстановкаЛимитовБюджета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.БюджетыПоКатегориям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Лимиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЛимита</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/БюджетыПоКатегориям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>БюджетыПоКатегориям</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаЛимита</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяРасхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыСтатей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСтатей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/УстановкаЛимитовБюджета/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьКатегориями(Команда)
	ЗаполнитьКатегориямиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПрошломуМесяцу(Команда)
	ЗаполнитьПоПрошломуМесяцуНаСервере();
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКатегориямиНаСервере() 
	
	Объект.Лимиты.Очистить();
	
	Выборка = Справочники.СтатьиДвиженияДенег.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Если Выборка.ТипСтатьи = Перечисления.ТипыСтатей.Расход Тогда
			
			НоваяСтрока = Объект.Лимиты.Добавить();
			
			НоваяСтрока.СтатьяРасходов = Выборка.Ссылка; 
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоПрошломуМесяцуНаСервере() 
	
	Объект.Лимиты.Очистить();
	
	ДатаПрошлогоМесяца = ДобавитьМесяц(НачалоМесяца(Объект.Дата), -1);
	
	ДанныеЗаПрошлыйМесяц = РегистрыСведений.БюджетыПоКатегориям.СрезПоследних(ДатаПрошлогоМесяца);
	
	Для Каждого ТекСтрока Из ДанныеЗаПрошлыйМесяц Цикл
		
		НоваяСтрока = Объект.Лимиты.Добавить();
		
		НоваяСтрока.СтатьяРасходов = ТекСтрока.СтатьяРасхода;
		НоваяСтрока.СуммаЛимита = ТекСтрока.СуммаЛимита;
		
	КонецЦикла;

КонецПроцедуры


#КонецОбласти
